In [2]:
import pandas as pd
from docx import Document

In [4]:
document = Document("PandasTableExtraction.docx")

### Reading Simple Table with no Heading

Simple tables have a uniform number of columns and rows, without any merged cells. This table contains no heading

In [13]:
table = document.tables[1]

data = [[cell.text for cell in row.cells] for row in table.rows]
df = pd.DataFrame(data)
df

             0      1
0   First Name  David
1    Last Name  Smith
2   Department  Sales
3  Blood Group     A+
4       Gender   Male

### Reading Simple Table with Heading

Simple tables have a uniform number of columns and rows, without any merged cells. This table contains heading

In [11]:
table = document.tables[0]

data = [[cell.text for cell in row.cells] for row in table.rows]
df = pd.DataFrame(data)
df = df.rename(columns=df.iloc[0]).drop(df.index[0]).reset_index(drop=True)
df

                Books               Author  Year
0  The Scarlet Letter  Nathaniel Hawthorne  1850
1   Heart of Darkness        Joseph Conrad  1902
2           The Pearl       John Steinbeck  1947
3   Gulliver's Travel       Jonathan Swift  1726
4         On the Road         Jack Kerouac  1957

### Reading Complex Tables

The following is a complex table, using merged cells as headers

In [15]:
outside_col, inside_col = df.iloc[0], df.iloc[1]
hier_index = pd.MultiIndex.from_tuples(list(zip(outside_col, inside_col)))
df = pd.DataFrame(data,columns=hier_index).drop(df.index[[0,1]] ).reset_index(drop=True)
df

           Jan 2020       Feb 2020       Mar 2020
     Items      Qty Price      Qty Price      Qty Price
0     Pens      853    50      973    50      953    55
1    Books      238    30      208    35      268    40
2  Binders      214    70      184    70      202    75
3  Pencils     1810    10     1570    10     1765    10
4  Erasers     1502     5     1307     7     2018     7

Reference: https://medium.com/@karthikeyan.eaganathan/read-tables-from-docx-file-to-pandas-dataframes-f7e409401370